big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
}
void mode_palette_control(uint8_t choice){
  
  switch (choice)
  {
  case 0:
    clear_leds(0);
    clear_leds(1);
    for(uint8_t j=0; j<10; j++){
      if(j == 9 or j == 7 or j == 6 or j == 4 or j== 3){
      for(uint8_t i=0; i<5; i++){
        leds[0][leds_arr[j][i]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        }
      }
      if(j == 8){
        leds[0][leds_arr[j][3]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
      if(j == 5 or j == 2){
        leds[0][leds_arr[j][4]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][0]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
      if(j == 1){
        leds[0][leds_arr[j][1]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][2]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][3]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
    }  

    for(uint8_t i=0; i<10; i++){
      if(i == 0 or i == 6){
        for(uint8_t j=0; j<5; j++){
          leds[1][leds_arr[i][j]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        }
      }
      if(i == 1){
        leds[1][leds_arr[i][4]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i == 2){
        leds[1][leds_arr[i][4]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][3]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i == 3 or i == 5){
        leds[1][leds_arr[i][0]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][1]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][3]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i == 4){
        leds[1][leds_arr[i][4]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i ==7 or i == 8){
        leds[1][leds_arr[i][0]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
    }

  break;
  
  case 1:
    // display words "mod" at the left 
    for(uint8_t j=0; j<10; j++){
      if(j == 9 or j == 7 or j == 6 or j == 4 or j== 3){
      for(uint8_t i=0; i<5; i++){
        leds[0][leds_arr[j][i]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        }
      }
      if(j == 8){
        leds[0][leds_arr[j][3]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
      if(j == 5 or j == 2){
        leds[0][leds_arr[j][4]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][0]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
      if(j == 1){
        leds[0][leds_arr[j][1]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][2]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][3]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
    }  
  break;

  default:
    break;
  }
  nblendPaletteTowardPalette(palettes_arr[2],palettes_arr[palette_index],70);
  FastLED.show();
}
void timer1_callback(TimerHandle_t pxTimer){
  timer1_started = true;
  brightness_control(0);
  brightness_control_flag = false;
  Serial.println("timer1 tick");
}

void timer3_callback(TimerHandle_t pxTimer){
  timer3_started = true;
  brightness_control(1);
  Serial.println("timer 3 tick");
}

void timer2_callback(TimerHandle_t pxTimer){
  timer2_started = true;
  brightness_control(2);
  Serial.println("timer 2 tick");
}

uint8_t touch_reader(){
  uint_fast8_t bin1, bin2, bin3;
  uint_fast8_t touch_out;
  if (touchRead(touch1)<=40){
    bin1 = B100;
    if(touch1_letgo){
      touch1_time = millis();
      touch1_letgo = false;
      short_press1 = true;
      long_press1 = true;
    }
  }
  else{
    bin1 = B0;
    touch1_letgo = true;
  }
  if(touchRead(touch2)<=40){
    bin2 = B010;
    if(touch2_letgo){
      touch2_time = millis();
      touch2_letgo = false;
      short_press2 = true;
      long_press2 = true;
    }
  }
  else{
    bin2 = B0;
    touch2_letgo = true;
  }
  if(touchRead(touch3)<40){
    bin3 = B001;
    if(touch3_letgo){
      touch3_time = millis();
      touch3_letgo = false;
      short_press3 = true;
      long_press3 = true;
    }
  }
  else{
    bin3 = B0;
    touch3_letgo = true;
  }
  touch_out = bin1 + bin2 + bin3;
  return touch_out;
}

void touch_func(void* parameters){
  uint8_t touch_reading;
  uint8_t first_touch_val;
  bool first_touch_flag = true;
  bool suspend_flag = false;
  bool white_lights = false;
  bool speaker_on = true;
  
  while(1){
    if(first_touch_flag ==true and touch_reader()>0){
      vTaskPrioritySet(NULL, 2);
      first_touch_val = touch_reader();
      first_touch_flag = false;
      Serial.print("first touch val: ");
      Serial.println(first_touch_val,BIN);
     }
    switch (first_touch_val)
    {
    case B100:
      //brightness controls
      touch_reading = touch_reader();
      vTaskSuspend(normal_vis_handle);
      vTaskSuspend(wave_vis_handle);
      vTaskSuspend(spi_handle);
      vTaskSuspend(fft_handle);
      suspend_flag =true;
      switch (touch_reading){
        case B100:
          // if brightness was changed before coming here, wait 500ms before showing default -+ menu
          if (brightness_control_flag == true){
            if(timer1_started == false){
              xTimerStart(touch1_timer,0);
              timer1_started = true;
              Serial.println("timer1 started");
            }
            if(timer2_started){
              xTimerStop(touch2_timer,0);
              timer2_started = false;
            }
            if(timer3_started){
              xTimerStop(touch3_timer,0);
              timer3_started = false;
            }
          }
          else{
            brightness_control(0);
          }
        break;
          
