big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
        case B101:
          if (timer1_started){
            xTimerStop(touch1_timer,0);
            timer1_started = false;
            Serial.println("timer1 stopped");
          }
          if(timer2_started){
            xTimerStop(touch2_timer,0);
            timer2_started = false;
          }
          if(millis()-touch3_time<1000){
            // Serial.print("touch3 time: ");
            // Serial.println((millis()-touch3_time));
            if(short_press3){
              brightness_control(1);
              short_press3 = false;
              Serial.println("short press 3");
            }
          }
          if(millis()-touch3_time>=1000){
            if(timer3_started == false){
              timer3_started = true;
              xTimerStart(touch3_timer, 0);
              Serial.println(brightness);
            }
          }
          brightness_control_flag = true;
        break;

        case B110:
          if(timer1_started){
            xTimerStop(touch1_timer,0);
            timer1_started = false;
          }
          if(timer3_started){
            xTimerStop(touch3_timer,0);
            timer3_started =false;
          }
          if(millis()-touch2_time<1000){
            //Serial.print("touch2 time: ");
            //Serial.println((millis()-touch2_time));
            if(short_press2){
              brightness_control(2);
              short_press2 = false;
              Serial.println("short press 2");
            }
          }
          if(millis()-touch2_time>=1000){
            if(timer2_started == false){
              timer2_started = true;
              xTimerStart(touch2_timer, 0);
              Serial.println(brightness);
            }
          }
          brightness_control_flag = true;
        break;

        default:
          Serial.println("exit first_touch B100 menu");
          if(timer1_started){
            xTimerStop(touch1_timer,0);
            timer1_started = false;
          }
          if(timer2_started){
            xTimerStop(touch2_timer,0);
            timer2_started = false;
          }
          if(timer3_started){
            xTimerStop(touch3_timer,0);
            timer3_started = false;
          }
          if(white_lights){
            fill_white_lights();
          }
          brightness_control_flag = false;
          first_touch_val = 0;
          first_touch_flag = true;
        break;
      }
    break;

    case B010:
      //mode and palette controls
      touch_reading = touch_reader();
      vTaskSuspend(normal_vis_handle);
      vTaskSuspend(wave_vis_handle);
      vTaskSuspend(spi_handle);
      vTaskSuspend(fft_handle);
      suspend_flag = true;
      // disable mode and palette controls when white lights are on
      if(white_lights){
        Serial.println("white lights enabled mode and pal controls disabled");
        mode_control_flag = false;
        first_touch_val = 0;
        first_touch_flag = true;
        break;
      }
      
      switch (touch_reading)
      {
      case B010:
      //speed up palette hue increment in menu to view palettes better
        if(hue_timer_change_peiod_flag == false){
          xTimerChangePeriod(hue_timer, pdMS_TO_TICKS(20), 0);
          hue_timer_change_peiod_flag = true;
        }
        if(wave_frame_timer_period_change_flag == false){
          xTimerChangePeriod(wave_frame_timer, pdMS_TO_TICKS(80),0);
          wave_frame_timer_period_change_flag = true;
          Serial.println("wave timer 80");
        }
        // only update the left led array when the mode animation is running
        if(mode_animation_started){
          mode_palette_control(1);
        }
        else{
          //show mode palette controls when no animation is running
          mode_palette_control(0);
        }
      break;
      
      case B110:
        //mode change 
        if(short_press1){
          short_press1 = false;
          mode_control_flag = true;
          current_mode += 1;
          if(current_mode >= 2){
            current_mode = 0;
          }
          Serial.print("current mode: ");
          Serial.println(current_mode);
          if (mode_animation_started == false){
            vTaskResume(mode_animation_handle);
            xTimerStart(mode_animation_timer, 0);
            mode_animation_started = true;
            Serial.println("mode animation started");
          }
          //reset the mode animation timer every time a mode is changed
          xTimerReset(mode_animation_timer,0);
        }
        //show mode palette controls when animation times out
        if(mode_animation_started == false){
          mode_palette_control(0);
          Serial.println("showing mode palette controls from mode change");
        }
        mode_palette_control(1);
      break;

      case B011:
        if(short_press3){
          short_press3 = false;
          if(palette_index<3){
            palette_index +=1;
          }
          else{
            palette_index = 0;
          }
          Serial.print("palette index: ");
          Serial.println(palette_index);
        }
        //if animation is running, only update the left led array
        if(short_press3 == false){
          if(mode_animation_started == true){
            mode_palette_control(1);
          }
          else{
          mode_palette_control(0);
          }
        }
        
      break;

      default:
        Serial.println("exit first touch B010 menu");
        mode_control_flag = false;
        first_touch_val = 0;
        first_touch_flag = true;
        if(mode_animation_started){
          vTaskSuspend(mode_animation_handle);
          mode_animation_started = false;
          xTimerStop(mode_animation_timer,0);
          Serial.println("mode animation stopped");
        }
        //change the hue increment timer back to original after closing mode and palette menu
        if(hue_timer_change_peiod_flag == true){
          xTimerChangePeriod(hue_timer, pdTICKS_TO_MS(80), 0);
          hue_timer_change_peiod_flag = false;
        }
        if(wave_frame_timer_period_change_flag == true){
          xTimerChangePeriod(wave_frame_timer, pdMS_TO_TICKS(65),0);
          wave_frame_timer_period_change_flag = false;
          Serial.println("wave timer 65");
        }
 
      break;
      }
    break;

    case B001:
      //white lights and speaker on off controls
      touch_reading = touch_reader();
      vTaskSuspend(normal_vis_handle);
      vTaskSuspend(wave_vis_handle);
      vTaskSuspend(spi_handle);
      vTaskSuspend(fft_handle);
      suspend_flag =true;
      switch (touch_reading){
        case B111:
          //turn of visualizer for white light, touch and hold longer to turn of speaker amplifier but keep lights on
          if (millis()-touch1_time<3000 and millis()-touch2_time<3000){
              if(short_press1 and short_press2 and short_press3){
                short_press1 = short_press2 = short_press3 = false;
                white_lights = !white_lights;
                if(white_lights){
                  vTaskDelay(1);
                  fill_white_lights();
                  Serial.println("white light on"); 
                }
                else{
                  Serial.println("white light off");
                }
              }
          }
          if (millis()-touch1_time>3000 and millis()-touch2_time>3000){
            if(long_press1 and long_press2 and long_press3){
              long_press1 = long_press2 = long_press3 = false;
              speaker_on = !speaker_on;
              Serial.println("toggle speakers");
              if(speaker_on){
                digitalWrite(relay_pin,LOW);
                Serial.println("speaker_on");
              }
              if(speaker_on != true){
                digitalWrite(relay_pin,HIGH);
                Serial.println("speaker off");
              }
            }
          }
        break;

