big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
          for(int j=0; j<=p_peak_column_height[f][i]; j++){
            p_leds[f][p_leds_arr[i][j]]= ColorFromPalette(palettes_arr[palette_index], i*5+ hue, brightness, LINEARBLEND);
          }
          
          for(int k=5; k>p_peak_column_height[f][i]; k--){
            p_leds[f][p_leds_arr[i][k]]=CHSV(0,0,0);
          }
        }
      }
      FastLED.show();
    }
    else{
      //Serial.println("waiting for processing");
      vTaskDelay(5/portTICK_PERIOD_MS);
    }
  }
}

void wave_vis(void* parameters){
  while(1){
    fft_out  processed_buf_received;

    uint8_t (*p_column_height)[10], (*p_peak_column_height)[10];
    p_column_height = column_height;
    p_peak_column_height = peak_column_height;

    uint8_t (*p_leds_arr)[6];
    p_leds_arr = leds_arr;

    uint16_t *p_mapping_max;
    p_mapping_max = &mapping_max;

    CRGB (*p_leds)[num_leds];
    p_leds = leds;

    if(xQueueReceive(fft_out_queue, (void *)&processed_buf_received, 0) == pdPASS){
      //Serial.println("processed output received");
      // standard 10 band visualizer output 
      for(uint8_t f=0; f<2; f++){
        for (uint8_t i = 0; i < 10; i++){
          if (processed_buf_received.post_process[f][i] >= *p_mapping_max){
            *p_mapping_max +=35;
            processed_buf_received.post_process[f][i] = *p_mapping_max;
          }
          column_height[f][i] = map(processed_buf_received.post_process[f][i], 120, *p_mapping_max, 0, 5);
          //get highest column to display 
          // reuse array to use peak decay timer
          if(p_peak_column_height[f][0] <= column_height[f][i]){
            p_peak_column_height[f][0] = column_height[f][i];
          }
        }
        for(int j=0; j<=p_peak_column_height[f][0]; j++){
          leds[f][leds_arr[0][j]]= ColorFromPalette(palettes_arr[palette_index], hue, brightness, LINEARBLEND);
          }
          
        for(int k=5; k>p_peak_column_height[f][0]; k--){
          leds[f][leds_arr[0][k]]=CHSV(0,0,0);
        }
      }
      if(shift_frame){
        shift_frame = false;
        xTimerStart(wave_frame_timer,0);
        for(uint8_t i=0; i<2; i++){
          for(uint8_t j=9; j>0; j--){
            p_peak_column_height[i][j]= p_peak_column_height[i][j-1];
          }

          for(uint8_t k=1; k<10; k++){
            for(uint8_t l=0; l <= p_peak_column_height[i][k]; l++){
              p_leds[i][p_leds_arr[k][l]] = ColorFromPalette(palettes_arr[palette_index], k*5+ hue, brightness, LINEARBLEND);
            }
            for(uint8_t m=5; m > p_peak_column_height[i][k]; m--){
              p_leds[i][p_leds_arr[k][m]] = CRGB(0,0,0);
            }
          }
        }
          
      }
      FastLED.show();
    }
    
    else{
      //Serial.println("waiting for processing");
      vTaskDelay(5/portTICK_PERIOD_MS);
    }
  }
}

void setup(){
  fft_in_queue = xQueueCreate(2, sizeof(spi_out));
  fft_out_queue = xQueueCreate(2,sizeof(fft_out));

  Serial.begin(115200);
  pinMode(relay_pin, OUTPUT); 
  pinMode(33, INPUT);

  vspi = new SPIClass(VSPI);
  vspi->begin(VSPI_SCLK, VSPI_MISO, VSPI_MOSI, VSPI_CS);
  pinMode(VSPI_CS, OUTPUT);
  // assign the arrays that can be processed to output the led colors.
  FastLED.addLeds<WS2812, left_leds, GRB>(leds[0], num_leds);
  FastLED.addLeds<WS2812, right_leds, GRB>(leds[1], num_leds);
  FastLED.setCorrection(TypicalSMD5050);

  uint8_t led_num =0;
  for(int i=0; i<10; i++){
    if(i%2 ==0 || i==0){
      for(int j=5;j>=0;j--){
        leds_arr[i][j]=led_num;
        led_num++;
      }
    }
    else{
      for(int k=0;k<=5;k++){
        leds_arr[i][k]=led_num;
        led_num++;
      }
    }   
  }
  
  xTaskCreatePinnedToCore(spi,"spi",6000,NULL,1,&spi_handle,1);
  xTaskCreate(fft, "fft", 6200, NULL, 1, &fft_handle);
  xTaskCreate(normal_vis,"normal_vis",2000,NULL,1,&normal_vis_handle);
  xTaskCreate(touch_func,"touch_func", 1500, NULL, 1, &ISR_handler_handle);
  xTaskCreate(wave_vis, "wave_vis", 1500, NULL, 1, &wave_vis_handle);
  xTaskCreate(mode_animation, "mode_animations", 2000, NULL, 1, &mode_animation_handle);

  vTaskSuspend(mode_animation_handle);
  vTaskSuspend(wave_vis_handle);

  // create timers to manage time routine tasks
  touch1_timer = xTimerCreate("touch1_timer", pdMS_TO_TICKS(3000), pdFALSE, (void*)1, timer1_callback);
  touch3_timer = xTimerCreate("touch3_timer", pdMS_TO_TICKS(200), pdTRUE, (void*)3 , timer3_callback);
  touch2_timer = xTimerCreate("touch2_timer", pdMS_TO_TICKS(200), pdTRUE, (void*)2, timer2_callback);
  hue_timer = xTimerCreate("hue_timer", pdMS_TO_TICKS(80), pdTRUE, (void*)4, hue_callback);
  mapping_decay_timer = xTimerCreate("mapping_decay", pdMS_TO_TICKS(250), pdTRUE, (void*)5, mapping_decay_callback);
  peak_decay_timer = xTimerCreate("peak_decay_timer", pdMS_TO_TICKS(70), pdTRUE, (void*)6, peak_decay_callback);
  wave_frame_timer = xTimerCreate("wave_frame_timer", pdMS_TO_TICKS(65), pdFALSE, (void*)7, wave_frame_callback);
  mode_animation_timer = xTimerCreate("mode_animation_timer", pdTICKS_TO_MS(3000), pdFALSE, (void*)8, mode_animation_callback);
  mode_animation_random_timer = xTimerCreate("mode_animation_random_timer", pdTICKS_TO_MS(250), pdFALSE,(void*)9,mode_animation_random_callback);


  xTimerStart(hue_timer, 0);
  xTimerStart(mapping_decay_timer, 0);
  xTimerStart(peak_decay_timer, 0);

  vTaskDelete(NULL);
}

void loop(){
    vTaskDelete(NULL);
  }
 
 